_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ОбменДаннымиСмета3_0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_ОбменДаннымиСмета3_0</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_Файлы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_РазделЛокальнойСметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_РазделЛокальнойСметы</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Comment>Внутренний код</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРодителя</Name>
					<Comment>Внутренний код</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДСметы</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректируетРаздел</Name>
					<Comment>Корректируемый раздел</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффОборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффОснЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффПолнСтоимРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимЗарплатеМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимМатериалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВДереве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВПределахСметы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_РазделыЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНРТекущая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСПТекущая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_Ресурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_Ресурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ГодыВыпускаБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКДП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводитьСтоимостьНаОбъем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ОбменДаннымиСмета3_0/Ext/ObjectModule.bsl
#Область ОписаниеПеременных

Перем НомерСсылки;
Перем ТаблицаЗагрузкиИд;
Перем ИмяОбъекта; 
Перем ТаблицаСсылок;

#КонецОбласти

#Область ПроцедурыИФункцииЭкспорта

Функция ХМЛРеквизит(ЗаписьXML,ТекОбъект,Реквизит,тип)
	ЗаписьXML.ЗаписатьНачалоЭлемента("Реквизит");
	ЗаписьXML.ЗаписатьАтрибут("Значение",Строка(ТекОбъект[Реквизит.Имя]));
	ЗаписьXML.ЗаписатьАтрибут("Имя",Строка(Реквизит.Имя));
	ЗаписьXML.ЗаписатьАтрибут("Тип",Строка(тип));
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецФункции

Функция ХМЛРеквизитНомер(ЗаписьXML,Значение,Реквизит)
	ЗаписьXML.ЗаписатьНачалоЭлемента("Реквизит");
	ЗаписьXML.ЗаписатьАтрибут("Значение",Строка(Значение));
	ЗаписьXML.ЗаписатьАтрибут("Имя",Реквизит);
	ЗаписьXML.ЗаписатьАтрибут("Тип","Число");
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецФункции

Функция ХМЛРеквизитССылка(ЗаписьXML,Реквизит2,ЗначениеСсылки,ТекТипЗнач)
	ЗаписьXML.ЗаписатьНачалоЭлемента("Реквизит");
	ЗаписьXML.ЗаписатьАтрибут("Ссылка",Строка(ЗначениеСсылки));
	ЗаписьXML.ЗаписатьАтрибут("Имя",Строка(Реквизит2.Имя));
	ЗаписьXML.ЗаписатьАтрибут("Тип",ТекТипЗнач);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецФункции

Функция ХМЛРеквизитТЧ(ЗаписьXML,СтрокаТЧ,РеквизитТЧ,типрекв)
	ЗаписьXML.ЗаписатьНачалоЭлемента("РеквизитТЧ");
	ЗаписьXML.ЗаписатьАтрибут("Значение",Строка(СтрокаТЧ[РеквизитТЧ.Имя]));
	ЗаписьXML.ЗаписатьАтрибут("Имя",Строка(РеквизитТЧ.Имя));
	ЗаписьXML.ЗаписатьАтрибут("Тип",Строка(типрекв));
	ЗаписьXML.ЗаписатьКонецЭлемента();  	
КонецФункции

Процедура ВыгрузитьДокументы(ДокументДляВыгрузки, ТаблицаВыгрузки, ТаблицаСсылок, ТаЗ, КаталогВыгрузки,АдресФайлаВоВременномХранилище,ИмяВременногоФайла,Версионирование = Ложь) Экспорт
	МассивТипов = Новый Массив;
	ЗаполнитьМассивТипов(МассивТипов); 
	ДобавитьДокументыПоТЧРодителя(ДокументДляВыгрузки, ТаблицаВыгрузки);
	ТаблицаСсылок = НоваяТС();

	// Формирование таблицы документов для выгрузки.
	ТабРезультат = ТаблицаВыгрузки.Скопировать();
	ТабРезультат.Свернуть("Документ,ИДРодителя,ДокументАрхива,Сортировка");
	ТабРезультат.Сортировать("Сортировка Возр");
	
	ДобавитьДокументыПоЛС2(ТабРезультат);
	ТабРезультат.Свернуть("Документ,ИДРодителя,ДокументАрхива,Сортировка");
	ТабРезультат.Сортировать("Сортировка Возр");
	
	// Определение глобальной таблицы ссылок и выгрузка документов.
    Для Каждого ТекСтрокаТаблицы Из ТабРезультат Цикл

		Документ 		= ТекСтрокаТаблицы.Документ;
    	ТекМетаданные 	= Документ.Метаданные();
		
		// Поиск уже выгруженных документов по ссылке.
		НайденнаяСтрокаДок = ТаблицаСсылок.Найти(Документ,"Ссылка");
		
		// Запись ссылок в глобальную таблицу.  
		Если НайденнаяСтрокаДок = Неопределено Тогда
			НоваяСтрока 					= ТаблицаСсылок.Добавить();
			НоваяСтрока.Ссылка				= Документ;
			НоваяСтрока.НаименованиеОбъекта	= ТекМетаданные.Имя;
			НоваяСтрока.НаименованиеПолное	= "";		
			НоваяСтрока.ТипОбъекта			= ТекМетаданные.ПолноеИмя();	
			НоваяСтрока.НомерПоПорядку		= 0;			
			НоваяСтрока.Загружен			= Ложь;
			
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
				НоваяСтрока.Порядок             = 5;
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
				НоваяСтрока.Порядок             = 4;
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
				НоваяСтрока.Порядок             = 3;
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
				НоваяСтрока.Порядок             = 6;
			Иначе
				НоваяСтрока.Порядок             = 0;
			КонецЕсли;
			
			Если ТипЗнч(Документ) <> Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда 
				НоваяСтрока.ИдРодителя = Документ.ИДРодителя;
			КонецЕсли;
			НоваяСтрока.ДокументАрхива	= ТекСтрокаТаблицы.ДокументАрхива;
		Иначе
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
				НайденнаяСтрокаДок.Порядок             = 5;
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
				НайденнаяСтрокаДок.Порядок             = 4;
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
				НайденнаяСтрокаДок.Порядок             = 3;
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
				НайденнаяСтрокаДок.Порядок             = 6;
			Иначе
				НайденнаяСтрокаДок.Порядок             = 0;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
				
		// Выгрузка реквизитов
		Для Каждого Реквизит Из ТекМетаданные.Реквизиты Цикл
			
			// Для СС,ОС,ЛС не выгружаем родителя по ссылке.
			// Будем проставлять "ИДРодителя" после загрузки всех документов, при необходимости.
			Если (ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_СводнаяСмета")
				ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета")
				ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета"))
				И (Реквизит.Имя = "ИДРодителя" ИЛИ Реквизит.Имя = "ИДСметы") Тогда
				Продолжить;
			КонецЕсли;	
			
			ВыгрузитьСсылочныйРеквизит(Документ, Реквизит, ТаблицаСсылок, ТекСтрокаТаблицы.ДокументАрхива, МассивТипов);
			
		КонецЦикла;
		
		// Выгрузка стандарнтых реквизитов.
		Для Каждого СтандартныйРеквизит Из ТекМетаданные.СтандартныеРеквизиты Цикл
			Если СтандартныйРеквизит.Имя = "Ссылка" ИЛИ СтандартныйРеквизит.Имя = "ТипЗначения" Тогда
				Продолжить;
			КонецЕсли;
			ВыгрузитьСсылочныйРеквизит(Документ, СтандартныйРеквизит, ТаблицаСсылок, ТекСтрокаТаблицы.ДокументАрхива, МассивТипов);
		КонецЦикла;

		// Выгрузка табличных частей.
		Для Каждого ТабЧасть Из ТекМетаданные.ТабличныеЧасти Цикл
			Если ТабЧасть.Имя = "ДополнительныеРеквизиты" Тогда
				Продолжить;
			КонецЕсли;
			// Цикл по строкам ТЧ документа.
			Для Каждого СтрокаТЧ Из Документ[ТабЧасть.Имя] Цикл
				// Цикл по реквизитам строки ТЧ документа.
				Для Каждого РеквизитСтроки Из ТабЧасть.Реквизиты Цикл
					ВыгрузитьСсылочныйРеквизит(СтрокаТЧ, РеквизитСтроки, ТаблицаСсылок, ТекСтрокаТаблицы.ДокументАрхива, МассивТипов);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаСсылок.Сортировать("Порядок Возр");
	Ном = 1;
	Для Каждого ТекСтрока Из ТаблицаСсылок Цикл
		ТекСтрока.НомерСортировки = Ном;
		Ном = Ном+1;
	КонецЦикла;	
		
	// ТаблицаСсылок.Сортировать("НомерСортировки Убыв");
	НовТаблицаСсылок 	= ТаблицаСсылок.Скопировать(); 
	ТабАрхивов 			= ТаблицаСсылок.Скопировать(); 
		
    // ***************************
    // Формирование файла выгрузки
    // ****************************
	Если Не Версионирование Тогда
		СТРИмя = Лев(Строка(ДокументДляВыгрузки), 50);
		
		RegExp = Новый COMОбъект("VBScript.RegExp");
		RegExp.MultiLine=Ложь; 
		RegExp.Global=Истина;
		RegExp.Pattern = "[^A-Zf-z0-9а-яА-Я\_\s\№\-]";
		Str1 = СокрЛП(СТРИмя);
		СТРИмя = RegExp.Replace(Str1, "");
		
		ИмяФайла = "" + СТРИмя + "_" + Формат(ТекущаяДатаСеанса(),"ДФ=dd.MM.yyyy") + ".xml";
		ФайлЗаписи 	= КаталогВыгрузки + "\" + ИмяФайла; 
		новфайл = ТаЗ.Добавить();
		новфайл.файл = ФайлЗаписи;
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML();
    ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла);
    ЗаписьXML.ЗаписатьОбъявлениеXML(); 
    ЗаписьXML.ЗаписатьНачалоЭлемента("Данные");   		
		
    //  Цикл по ссылочным объектам
    Для Каждого ТекСтрока Из ТаблицаСсылок Цикл
		
		Если ТекСтрока.Ссылка.ПолучитьОбъект() = Неопределено тогда
			Продолжить;
		КонецЕсли;

    	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
    	// ЗаписьXML.ЗаписатьАтрибут("Наименование",Строка(ТекСтрока.НаименованиеОбъекта)); 
    	ЗаписьXML.ЗаписатьАтрибут("НПП",Строка(ТекСтрока.НомерСортировки));
    	ЗаписьXML.ЗаписатьАтрибут("Тип",Строка(ТекСтрока.ТипОбъекта));
    	
    	ТекМетаданные2  = ТекСтрока.Ссылка.Метаданные();
    	ТекОбъект		= ТекСтрока.Ссылка; 
		
		
		//  Выгрузка реквизитов
		Для Каждого Реквизит2 Из ТекМетаданные2.Реквизиты Цикл
			
			Если Реквизит2.Имя = "НомерВДереве"
				ИЛИ Реквизит2.Имя = "НомерВПределахСметы"
				ИЛИ Реквизит2.Имя = "ПорНомер" Тогда
				Продолжить;
			КонецЕсли;
			типрекв = ТипЗнч(ТекОбъект[Реквизит2.Имя]);
			
			//  Примитивный тип
			Если  МассивТипов.Найти(типрекв) <> Неопределено Тогда
				    ХМЛРеквизит(ЗаписьXML,ТекОбъект,Реквизит2,типрекв); 
				//  Ссылочный тип	
			Иначе
				
				Если НЕ ЗначениеЗаполнено(ТекОбъект[Реквизит2.Имя]) Тогда
					Продолжить;			
				КонецЕсли;
				
				ТекТипЗнач = ОпределитьТипСсылочногоРеквизита(ТекОбъект[Реквизит2.Имя]);
				
				Если Найти(ТекТипЗнач,"Перечисление") > 0 Тогда
					 ХМЛРеквизит(ЗаписьXML,ТекОбъект,Реквизит2,ТекТипЗнач);  						
				Иначе	
					
		  			//  ищем в глобальной таблице и ставим ссылку
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("Ссылка",ТекОбъект[Реквизит2.Имя]);
					
					МассивСсылок = НовТаблицаСсылок.НайтиСтроки(СтруктураПоиска);
					Если МассивСсылок.Количество() > 0 Тогда
						ЗначениеСсылки = МассивСсылок[0].НомерСортировки; 						
					Иначе
						ЗначениеСсылки = "пусто";	
					КонецЕсли;
					    ХМЛРеквизитССылка(ЗаписьXML,Реквизит2,ЗначениеСсылки,ТекТипЗнач);						
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;

		Если ТипЗнч(ТекОбъект) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")
			ИЛИ ТипЗнч(ТекОбъект) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
			НомераОбъекта = СМ_СметаВызовСервера.ПолучитьНомерДокумента(ТекОбъект,ТекМетаданные2.Имя);
			ХМЛРеквизитНомер(ЗаписьXML,НомераОбъекта.НомерВДереве,"НомерВДереве");
			ХМЛРеквизитНомер(ЗаписьXML,НомераОбъекта.НомерВПределахСметы,"НомерВПределахСметы");
			ХМЛРеквизитНомер(ЗаписьXML,НомераОбъекта.ПорНомер,"ПорНомер");
		КонецЕсли;
		
		
		//  Выгрузка стандартных реквизитов
		Для Каждого Реквизит3 Из ТекМетаданные2.СтандартныеРеквизиты Цикл
			
			Если Реквизит3.Имя = "Ссылка" Тогда
				Продолжить;
			КонецЕсли;
			
			//  Примитивный тип
			типрекв = ТипЗнч(ТекОбъект[Реквизит3.Имя]);
			
			Если  МассивТипов.Найти(типрекв) <> Неопределено Тогда
				    ХМЛРеквизит(ЗаписьXML,ТекОбъект,Реквизит3,типрекв);					
			//  Ссылочный тип	
			Иначе
				
				Если НЕ ЗначениеЗаполнено(ТекОбъект[Реквизит3.Имя]) Тогда
					Продолжить;			
				КонецЕсли;
				
				ТекТипЗнач = ОпределитьТипСсылочногоРеквизита(ТекОбъект[Реквизит3.Имя]);
		
				Если Найти(ТекТипЗнач,"Перечисление") > 0 Тогда
					ХМЛРеквизит(ЗаписьXML,ТекОбъект,Реквизит3,ТекТипЗнач);							
				Иначе				
				
					//  ищем в глобальной таблице и ставим ссылку
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("Ссылка",ТекОбъект[Реквизит3.Имя]);
					
					МассивСсылок = НовТаблицаСсылок.НайтиСтроки(СтруктураПоиска);
					Если МассивСсылок.Количество() > 0 Тогда
						ЗначениеСсылки = МассивСсылок[0].НомерСортировки; 						
					Иначе
						ЗначениеСсылки = "пусто";	
					КонецЕсли;
					
					 ХМЛРеквизитССылка(ЗаписьXML,Реквизит3,ЗначениеСсылки,ТекТипЗнач);	
					
				КонецЕсли;

			КонецЕсли;
			
		КонецЦикла;
		
    	// Выгрузка табличных частей.
    	// Цикл по табличным частям документа.
		
		Если ТекМетаданные2.ТабличныеЧасти.Количество() > 0 Тогда
		
	  		ЗаписьXML.ЗаписатьНачалоЭлемента("ТабличныеЧасти");  
	  		Для Каждого ТабЧасть Из ТекМетаданные2.ТабличныеЧасти Цикл
	   			ЗаписьXML.ЗаписатьНачалоЭлемента("ТабличнаяЧасть");
	    		ЗаписьXML.ЗаписатьАтрибут("Имя", ТабЧасть.Имя);
	   	
	  	      	//  Цикл по строкам ТЧ документа
	  	      	Для Каждого СтрокаТЧ Из ТекОбъект[ТабЧасть.Имя] Цикл
	  	      		ЗаписьXML.ЗаписатьНачалоЭлемента("СтрокаТабличнойЧасти");
	  	      		ЗаписьXML.ЗаписатьАтрибут("НомерСтроки", Строка(СтрокаТЧ.НомерСтроки));

	  	      		//  Цикл по реквизитам строки ТЧ документа
	    			Для Каждого РеквизитТЧ Из ТабЧасть.Реквизиты Цикл
	    				
	    				//  Примитивный тип
						типрекв = ТипЗнч(СтрокаТЧ[РеквизитТЧ.Имя]); 
						
	    				Если  МассивТипов.Найти(типрекв) <> Неопределено Тогда
							
							ХМЛРеквизитТЧ(ЗаписьXML,СтрокаТЧ,РеквизитТЧ,типрекв);		    					
	    				//  Ссылочный тип	
	    				Иначе
							
							Если НЕ ЗначениеЗаполнено(СтрокаТЧ[РеквизитТЧ.Имя]) Тогда
								Продолжить;			
							КонецЕсли;
							
	    					ТекТипЗнач = ОпределитьТипСсылочногоРеквизита(СтрокаТЧ[РеквизитТЧ.Имя]);

							Если Найти(ТекТипЗнач,"Перечисление") > 0 Тогда
								ХМЛРеквизитТЧ(ЗаписьXML,СтрокаТЧ,РеквизитТЧ,ТекТипЗнач);											
							Иначе							
								
		    					//  ищем в глобальной таблице и ставим ссылку
		    					СтруктураПоиска = Новый Структура;
		    					СтруктураПоиска.Вставить("Ссылка",СтрокаТЧ[РеквизитТЧ.Имя]);
		    					
		    					МассивСсылок = НовТаблицаСсылок.НайтиСтроки(СтруктураПоиска);
		    					Если МассивСсылок.Количество() > 0 Тогда
		    						ЗначениеСсылки = МассивСсылок[0].НомерСортировки; 						
		    					Иначе
		    						ЗначениеСсылки = "пусто";	
		    					КонецЕсли;
								
								ЗаписьXML.ЗаписатьНачалоЭлемента("РеквизитТЧ");
		    				    ЗаписьXML.ЗаписатьАтрибут("Ссылка",Строка(ЗначениеСсылки));
		    					ЗаписьXML.ЗаписатьАтрибут("Имя",Строка(РеквизитТЧ.Имя));
		    					ЗаписьXML.ЗаписатьАтрибут("Тип",ТекТипЗнач);
		    					ЗаписьXML.ЗаписатьКонецЭлемента();
								
							КонецЕсли;	
		   				КонецЕсли;
					КонецЦикла;
					
	   				ЗаписьXML.ЗаписатьКонецЭлемента();
	  		  	КонецЦикла;
	  		  	ЗаписьXML.ЗаписатьКонецЭлемента();
	 		КонецЦикла;
	    	ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
    	ЗаписьXML.ЗаписатьКонецЭлемента();
    КонецЦикла;
		
				

	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();

	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	Если Версионирование Тогда
		АдресФайлаВоВременномХранилище = ДвоичныеДанные;
	Иначе
		АдресФайлаВоВременномХранилище = Новый Соответствие;
		АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
		АдресФайлаВоВременномХранилище.Вставить(ФайлЗаписи,АдресФайла);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ВыгрузитьСсылочныйРеквизит(ТекОбъект, ТекРеквизит, ТаблицаСсылок, ДокументАрхива, МассивТипов,Порядок = -1)
	
	//  Примитивный тип
	
	Если  МассивТипов.Найти(ТипЗнч(ТекОбъект[ТекРеквизит.Имя])) <> Неопределено Тогда
	
	// Ссылочный тип	
	Иначе
		ЗначениеРеквизита = ТекОбъект[ТекРеквизит.Имя];

		// Ссылочный тип пишем в глобальную таблицу.
		Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
			
			ТипЗначенияРеквизита = ОпределитьТипСсылочногоРеквизита(ЗначениеРеквизита);
			
			// Определение является ли ссылочный реквизит перечислением.
			// Перечисления пропускаются при добавлении ссылочных реквизитов в таблицу.
			Если НЕ (Найти(ТипЗначенияРеквизита,"Перечисление") > 0) Тогда
				
				// Если ссылка не найдена в таблице записываем ссылку в глобальную таблицу.  
				НайденнаяСтрока = ТаблицаСсылок.Найти(ЗначениеРеквизита,"Ссылка");
				Если НайденнаяСтрока = Неопределено Тогда
					
					НоваяСтрока 					= ТаблицаСсылок.Добавить();
					НоваяСтрока.Ссылка				= ЗначениеРеквизита;
					НоваяСтрока.НаименованиеОбъекта	= ТекРеквизит.Имя;
					НоваяСтрока.НаименованиеПолное	= "";		
					НоваяСтрока.ТипОбъекта			= ТипЗначенияРеквизита;	
					НоваяСтрока.НомерПоПорядку		= 0;	
					НоваяСтрока.Загружен			= Ложь;
					НоваяСтрока.ДокументАрхива		= ДокументАрхива;
					
					Если ТипЗнч(ДокументАрхива) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
						ПорядокДоп             = 5;
					ИначеЕсли ТипЗнч(ДокументАрхива) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
						ПорядокДоп             = 4;
					ИначеЕсли ТипЗнч(ДокументАрхива) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
						ПорядокДоп             = 3;
					ИначеЕсли ТипЗнч(ДокументАрхива) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
						ПорядокДоп             = 6;
					Иначе
						ПорядокДоп             = 0;
					КонецЕсли;

					НоваяСтрока.Порядок             = ?(СтрНайти(ВРег(ТипЗначенияРеквизита),"ДОКУМЕНТ")=0,Порядок,ПорядокДоп);
				// Если ссылка найдена в таблице, сдвигаем ее в самый конец.
				// Для того, чтобы при загрузке из файла она была загружена раньше.
				Иначе
					Если ТекРеквизит.Имя = "ВладелецФайла" ИЛИ ТекРеквизит.Имя = "СсылкаНаАкт" Тогда
						Возврат;
					КонецЕсли;
					ТекИндексСтроки = ТаблицаСсылок.Индекс(НайденнаяСтрока);
					КоличествоСтрок = ТаблицаСсылок.Количество();
					Смещение		= КоличествоСтрок - ТекИндексСтроки - 1;
					ТаблицаСсылок.Сдвинуть(НайденнаяСтрока, Смещение);
				КонецЕсли;
				
				// Ссылка уже выгружалась, пойдем дальше.
				Если Не НайденнаяСтрока = Неопределено Тогда 					
					Возврат;
				КонецЕсли;
				
				// Выгрузка реквизитов.
				Для Каждого Реквизит Из ЗначениеРеквизита.Метаданные().Реквизиты Цикл
					Если Реквизит.Имя = "ИДРодителя" ИЛИ Реквизит.Имя = "ИДСметы" ИЛИ (Реквизит.Имя = "ИДПозицииВладельца")Тогда
						Если ТаблицаСсылок.Найти(ЗначениеРеквизита,"Ссылка") = Неопределено Тогда
							ВыгрузитьСсылочныйРеквизит(ЗначениеРеквизита, Реквизит, ТаблицаСсылок, ДокументАрхива, МассивТипов,Порядок-1);				
						КонецЕсли;
					Иначе 
						ВыгрузитьСсылочныйРеквизит(ЗначениеРеквизита, Реквизит, ТаблицаСсылок, ДокументАрхива, МассивТипов,Порядок-1);
					КонецЕсли;
				КонецЦикла;
				
				// Выгрузка стандарнтых реквизитов. 
				Для Каждого СтандартныйРеквизит Из ЗначениеРеквизита.Метаданные().СтандартныеРеквизиты Цикл
					Если СтандартныйРеквизит.Имя = "Ссылка" ИЛИ СтандартныйРеквизит.Имя = "ТипЗначения" Тогда
						Продолжить;
					КонецЕсли;
					ВыгрузитьСсылочныйРеквизит(ЗначениеРеквизита, СтандартныйРеквизит, ТаблицаСсылок, ДокументАрхива, МассивТипов,Порядок-1);
				КонецЦикла;
				
				// Выгрузка табличных частей.
				Для Каждого ТабЧасть Из ЗначениеРеквизита.Метаданные().ТабличныеЧасти Цикл
					Если ТабЧасть.Имя = "ДополнительныеРеквизиты" Тогда
						Продолжить;
					КонецЕсли;
					// Цикл по строкам ТЧ документа.
					Для Каждого СтрокаТЧ Из ЗначениеРеквизита[ТабЧасть.Имя] Цикл
						// Цикл по реквизитам строки ТЧ документа.
						Для Каждого РеквизитСтроки Из ТабЧасть.Реквизиты Цикл
							ВыгрузитьСсылочныйРеквизит(СтрокаТЧ, РеквизитСтроки, ТаблицаСсылок, ДокументАрхива, МассивТипов,Порядок-1);
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Функция НоваяТС()
	ТаблицаСсылок = Новый ТаблицаЗначений;
	ТаблицаСсылок.Колонки.Добавить("Ссылка");	
	ТаблицаСсылок.Колонки.Добавить("НаименованиеОбъекта");	
	ТаблицаСсылок.Колонки.Добавить("НаименованиеПолное");	
	ТаблицаСсылок.Колонки.Добавить("ТипОбъекта");	
	ТаблицаСсылок.Колонки.Добавить("НомерПоПорядку");		
	ТаблицаСсылок.Колонки.Добавить("НомерСортировки");
	ТаблицаСсылок.Колонки.Добавить("Загружен");
	ТаблицаСсылок.Колонки.Добавить("ИдРодителя");
	ТаблицаСсылок.Колонки.Добавить("ИдСметы");
	ТаблицаСсылок.Колонки.Добавить("ДокументАрхива");
	ТаблицаСсылок.Колонки.Добавить("Порядок");
	Возврат ТаблицаСсылок;
КонецФункции

Процедура ЗаполнитьМассивТипов(МассивТипов)
	МассивТипов.Добавить(Тип("Число"));
	МассивТипов.Добавить(Тип("Строка"));	 				
	МассивТипов.Добавить(Тип("Булево"));
	МассивТипов.Добавить(Тип("Дата"));
	МассивТипов.Добавить(Тип("УникальныйИдентификатор"));
	МассивТипов.Добавить(Тип("ХранилищеЗначения"));
	МассивТипов.Добавить(Тип("Null"));
КонецПроцедуры

Процедура ДобавитьДокументыПоТЧРодителя(Документ, ТаблицаВыгрузки)
	                                    
	ТаблицаВыгрузки.Очистить();

	ТекДокумент = Документ;
	НоваяСтрока 				= ТаблицаВыгрузки.Добавить();
	НоваяСтрока.Документ 		= ТекДокумент;
	НоваяСтрока.ДокументАрхива 	= ТекДокумент;	
	
	Если ТипЗнч(ТекДокумент) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		
		НоваяСтрока.Сортировка = 1;
		
		Для Каждого ТекСтрока Из ТекДокумент.Сметы Цикл
			НоваяСтрока 				= ТаблицаВыгрузки.Добавить();
			НоваяСтрока.Документ 		= ТекСтрока.Смета;
			НоваяСтрока.ИдРодителя 		= ТекСтрока.Смета.ИдРодителя;
			НоваяСтрока.ДокументАрхива 	= ТекДокумент;	
			НоваяСтрока.Сортировка		= 3;
			
			Если ТипЗнч(ТекСтрока.Смета) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
				НоваяСтрока.Сортировка = 2;
				Для Каждого ТекСтрокаОС Из ТекСтрока.Смета.ЛокальныеСметы Цикл
					НоваяСтрока 				= ТаблицаВыгрузки.Добавить();
					НоваяСтрока.Документ 		= ТекСтрокаОС.ЛокальнаяСмета;
					НоваяСтрока.ИдРодителя 		= ТекСтрокаОС.ЛокальнаяСмета.ИдРодителя;
					НоваяСтрока.ДокументАрхива 	= ТекДокумент;	
					НоваяСтрока.Сортировка		= 3;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ТекДокумент) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		НоваяСтрока.Сортировка = 2;
		Для Каждого ТекСтрокаОС Из ТекДокумент.ЛокальныеСметы Цикл
			НоваяСтрока 				= ТаблицаВыгрузки.Добавить();
			НоваяСтрока.Документ 		= ТекСтрокаОС.ЛокальнаяСмета;
			НоваяСтрока.ИдРодителя 		= ТекСтрокаОС.ЛокальнаяСмета.ИдРодителя;
			НоваяСтрока.ДокументАрхива 	= ТекДокумент;
			НоваяСтрока.Сортировка		= 3;
		КонецЦикла;
	Иначе
		НоваяСтрока.ДокументАрхива 	= ТекДокумент;	
		НоваяСтрока.Сортировка		= 3;
	КонецЕсли;
КонецПроцедуры

Функция ДобавитьДокументыПоЛС2(ТабДокументов)
	
	СписокСметы = ТабДокументов.ВыгрузитьКолонку("Документ"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СМ_АктВыполненныхРабот.Ссылка,
	|	СМ_АктВыполненныхРабот.ЛокальнаяСмета КАК ИДСметы,
	|	СМ_АктВыполненныхРабот.ИДРодителя,
	|   4 КАК Сортировка
	|ИЗ
	|	Документ.СМ_АктВыполненныхРабот КАК СМ_АктВыполненныхРабот
	|ГДЕ
	|	СМ_АктВыполненныхРабот.ЛокальнаяСмета В(&СписокСметы)	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СМ_ПозицияЛокальнойСметы.Ссылка,
	|	СМ_ПозицияЛокальнойСметы.ИДСметы,
	|	СМ_ПозицияЛокальнойСметы.ИДРодителя,
	|   7 КАК Сортировка
	|ИЗ
	|	Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	|ГДЕ
	|	СМ_ПозицияЛокальнойСметы.ИДСметы В(&СписокСметы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СМ_РазделЛокальнойСметы.Ссылка,
	|	СМ_РазделЛокальнойСметы.ИДСметы,
	|	СМ_РазделЛокальнойСметы.ИДРодителя,
	|   5 КАК Сортировка
	|ИЗ
	|	Документ.СМ_РазделЛокальнойСметы КАК СМ_РазделЛокальнойСметы
	|ГДЕ
	|	СМ_РазделЛокальнойСметы.ИДСметы В(&СписокСметы)";
	
	Запрос.УстановитьПараметр("СписокСметы",СписокСметы);
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	
	ТабРезультат.Свернуть("Ссылка,ИДСметы,ИдРодителя,Сортировка");
	Для Каждого ТекСтрока Из ТабРезультат Цикл
		НайденнаяСтрока = ТабДокументов.Найти(ТекСтрока.ИДСметы);
		Если НайденнаяСтрока <> Неопределено Тогда
			
			НоваяСтрока 				= ТабДокументов.Добавить();
			НоваяСтрока.Документ        = ТекСтрока.Ссылка;
			НоваяСтрока.ИДРодителя      = ТекСтрока.ИдРодителя;
			НоваяСтрока.ДокументАрхива  = НайденнаяСтрока.ДокументАрхива;
			НоваяСтрока.Сортировка		= ТекСтрока.Сортировка;
			
			Если ТипЗнч(ТекСтрока.Ссылка) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
				Если ТипЗнч(ТекСтрока.ИдРодителя) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
					НоваяСтрока.Сортировка = 6;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;

КонецФункции

Функция ОпределитьТипСсылочногоРеквизита(ЗначениеРеквизита)
	
	Если ТипЗнч(ЗначениеРеквизита) = Тип("ОписаниеТипов") Тогда
		ТекТип = "ОписаниеТипов";
	Иначе
		ТекТип = ЗначениеРеквизита.Метаданные().ПолноеИмя();
	КонецЕсли;
	Возврат ТекТип;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииИмпорта

Процедура ЗагрузитьДокументы(ПутьКФайлу,ТЗЗагрузки,Версионирование = Ложь, Знач ВосстанавливаемоеЗначение = Неопределено,Откат = Ложь) Экспорт
	
	Если Откат Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	ТаблицаСсылок = Новый ТаблицаЗначений;
	ТаблицаСсылок.Очистить();
	ТаблицаСсылок.Колонки.Добавить("Ссылка");	
	ТаблицаСсылок.Колонки.Добавить("НомерПоПорядку");            	
	ТаблицаСсылок.Колонки.Добавить("Тип");            
	ТаблицаСсылок.Колонки.Добавить("ТипОбъекта");       
	ТаблицаСсылок.Колонки.Добавить("НомерСортировки");                
	ТаблицаСсылок.Колонки.Добавить("НомерВДереве");            
	ТаблицаСсылок.Колонки.Добавить("НомерВПределахСметы");       
	ТаблицаСсылок.Колонки.Добавить("ПорНомер");                
	
	ТаблДок = Новый ТаблицаЗначений;
	ТаблДок.Колонки.Добавить("Ссылка");
	
	ТаблицаЗагрузкиИд =  Новый ТаблицаЗначений;
	ТаблицаЗагрузкиИд.Очистить();
	ТаблицаЗагрузкиИд.Колонки.Добавить("НомерПоПорядку");
	ТаблицаЗагрузкиИд.Колонки.Добавить("ИмяРеквизита");	
	ТаблицаЗагрузкиИд.Колонки.Добавить("ИДРодителя");
	
	Если Не Версионирование Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		Запись = РегистрыСведений.СМ_Файлы.Выбрать(Новый Структура("ИмяФайла",ПутьКФайлу)); 
		Запись.Следующий();
		ДвоичныеДанные = Запись.Файл.Получить();
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
	Иначе
		ИмяВременногоФайла = ПутьКФайлу;
	КонецЕсли;
	
	ТекстОшибки = "";
	НачатьТранзакцию();
	
	Чтение = Новый ЧтениеXML; 
	Чтение.ОткрытьФайл(ИмяВременногоФайла); 
	Пока Чтение.Прочитать() Цикл 

		//  Прочитать "структурные части" элементов. 
		//  Проверить, какая часть элемента - текущая. 
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			ИмяУзла = Чтение.Имя; 
			
			Если ИмяУзла = "Объект" Тогда
				СтруктураОбъекта 	= Новый Структура;
				СтруктураАтрибутов 	= Новый Структура; 
				СтруктураТЧ			= Новый Структура;
				ТекИмяТЧ			= "";
				Номерссылки = 0;
				Пока (Чтение.ТипУзла <> ТипУзлаXML.КонецЭлемента) И Чтение.ПрочитатьАтрибут() Цикл 
					//  Прочитать данные узла атрибута. 
					ТипУзла 	= Чтение.ТипУзла; 
					Имя 		= Чтение.Имя; 
					Значение 	= Чтение.Значение; 
					//  Обработать полученные значения.
					Если Имя = "Тип" Тогда
						СтруктураОбъекта.Вставить(Имя,Значение);
						Если Найти(Чтение.Значение,"Справочник") > 0 Тогда 	
							
							ИмяОбъекта = СтрЗаменить(Чтение.Значение,"Справочник.","");						    				
							
							Попытка
								новэлемент = Справочники[ИмяОбъекта].СоздатьЭлемент();
							Исключение
								Продолжить;
							КонецПопытки;
							
							НоваяЗапись = ТаблицаСсылок.Добавить();
							НоваяЗапись.НомерПоПорядку = Число(Номерссылки);
							НоваяЗапись.Тип = "Справочник";
							Пока Чтение.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл 
								ЗаполнятьРеквизиты(новэлемент,Чтение);
							КонецЦикла;
							
							// СНБ ищем сначала по коду, потом по наименованию
							Если ИмяОбъекта = "СМ_СметноНормативныеБазы" Тогда
								резпоиска = Справочники.СМ_Ресурсы.НайтиПоКоду(новэлемент.Код);
								Если резпоиска = Справочники[ИмяОбъекта].ПустаяССылка() Тогда 
									резпоиска = Справочники[ИмяОбъекта].НайтиПоНаименованию(новэлемент.Наименование);
								КонецЕсли;
							// Ресурсы подгружаем по коду
							ИначеЕсли ИмяОбъекта = "СМ_Ресурсы" Тогда
								резпоиска = Справочники.СМ_Ресурсы.НайтиПоКоду(новэлемент.Код);
							Иначе
								резпоиска = Справочники[ИмяОбъекта].НайтиПоНаименованию(новэлемент.Наименование);
							КонецЕсли;
							
							Если резпоиска <> Справочники[ИмяОбъекта].ПустаяССылка() Тогда 
								НоваяЗапись.Ссылка = резпоиска.Ссылка;
							Иначе
								Если Не Версионирование Тогда
									Если ИмяОбъекта = "СМ_Ресурсы" И СМ_СметаВызовСервера.НедоступнаРаботаСПрайсами() Тогда
										ТекстОшибки = ТекстОшибки + "Не найден ресурс: " + новэлемент.Наименование + ". Загрузка отменена." + Символы.ПС;
									КонецЕсли;
								КонецЕсли;
								Если Не ЗначениеЗаполнено(новэлемент.Код) Тогда
									новэлемент.УстановитьНовыйКод();
								КонецЕсли;
								новэлемент.ОбменДанными.Загрузка = Истина;
								новэлемент.Записать();
								НоваяЗапись.Ссылка = новэлемент.Ссылка;
							КонецЕсли;
						Иначе 
							ИмяОбъекта = СтрЗаменить(Чтение.Значение,"Документ.","");
							// Первый документ - может быть наш документ.
							Если ВосстанавливаемоеЗначение <> Неопределено Тогда
								новэлемент =ВосстанавливаемоеЗначение.ПолучитьОбъект();
								ВосстанавливаемоеЗначение = Неопределено;
							Иначе
								Попытка
									СсылкаНового = Документы[ИмяОбъекта].ПолучитьСсылку();
								Исключение
									Продолжить;
								КонецПопытки;
								новэлемент = Документы[ИмяОбъекта].СоздатьДокумент();
								новэлемент.УстановитьСсылкуНового(СсылкаНового);
							КонецЕсли;
							
							НоваяЗапись = ТаблицаСсылок.Добавить();
							НоваяЗапись.Тип = "Документ";
							НоваяЗапись.НомерПоПорядку = Число(Номерссылки); 
							НоваяЗапись.ТипОбъекта = ИмяОбъекта;
							
							Если ИмяОбъекта = "СМ_ОбъектнаяСмета" Тогда
								НоваяЗапись.НомерСортировки = 1;
							ИначеЕсли ИмяОбъекта = "СМ_СводнаяСмета" Тогда
								НоваяЗапись.НомерСортировки = 2;
							ИначеЕсли ИмяОбъекта = "СМ_ЛокальнаяСмета" Тогда 
								НоваяЗапись.НомерСортировки = 3;
							Иначе 
								НоваяЗапись.НомерСортировки = 6;
							КонецЕсли;
							
							Пока Чтение.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл 
								ЗаполнятьРеквизиты(новэлемент,Чтение);
							КонецЦикла;
							
							Если новэлемент.ДополнительныеСвойства.Свойство("НомерВДереве") Тогда
								НоваяЗапись.НомерВДереве = новэлемент.ДополнительныеСвойства.НомерВДереве;
								НоваяЗапись.НомерВПределахСметы = новэлемент.ДополнительныеСвойства.НомерВПределахСметы;
								НоваяЗапись.ПорНомер = новэлемент.ДополнительныеСвойства.ПорНомер;
								новэлемент.ДополнительныеСвойства.Очистить();
								новэлемент.ДополнительныеСвойства.Вставить("Смета3");
							КонецЕсли;
							
							новэлемент.УстановитьНовыйНомер();
							
							Если Не ЗначениеЗаполнено(новэлемент.Дата) Тогда
								новэлемент.Дата = ТекущаяДатаСеанса();
							КонецЕсли;
							
							новэлемент.Записать(); 				
							НоваяЗапись.Ссылка = новэлемент.Ссылка;		
						КонецЕсли;

					ИначеЕсли Имя = "НПП" Тогда 
					    Номерссылки = Чтение.Значение;
					ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда  
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	

	Если ТекстОшибки = "" Тогда
		
		// Пересчет документов
		отбор = Новый Структура;
		отбор.Вставить("Тип","Документ");
		ТаблицаСсылок.Сортировать(НСтр("ru='НомерСортировки убыв, НомерПоПорядку убыв'")); 
		Для Каждого докст Из ТаблицаСсылок.НайтиСтроки(отбор) Цикл 
			отбор1 = Новый Структура;
			отбор1.Вставить("НомерПоПорядку",докст.НомерПоПорядку);
			д1 = докст.Ссылка.ПолучитьОбъект();
			Для Каждого док Из ТаблицаЗагрузкиИд.НайтиСтроки(отбор1) Цикл 
				искомыйродитель = ТаблицаСсылок.Найти(док.ИДРодителя,"НомерПоПорядку");
				Если искомыйродитель <> Неопределено Тогда
					д1[док.ИмяРеквизита] = искомыйродитель.Ссылка;
				КонецЕсли;
			КонецЦикла;
			д1.ПроверитьЗаполнение();
			д1.ОбменДанными.Загрузка = Истина;
			д1.Записать();
			
			Если ТипЗнч(докст.Ссылка) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
				СМ_СметаВызовСервера.УстановитьНомерДокумента(докст.Ссылка,докст.ПорНомер,докст.НомерВПределахСметы,докст.НомерВДереве, , "СМ_ПозицияЛокальнойСметы");
			ИначеЕсли ТипЗнч(докст.Ссылка) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
				СМ_СметаВызовСервера.УстановитьНомерДокумента(докст.Ссылка,докст.ПорНомер,докст.НомерВПределахСметы,докст.НомерВДереве, , "СМ_РазделЛокальнойСметы");
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого докст Из ТаблицаСсылок.НайтиСтроки(отбор) Цикл 
			Если докст.НомерСортировки <= 3 Тогда
				д1 = докст.Ссылка.ПолучитьОбъект();
				
				Если докст.ТипОбъекта = "СМ_ЛокальнаяСмета" Тогда
					Документы[докст.ТипОбъекта].Перерасчет(д1.Ссылка,Ложь,,Версионирование);
				Иначе
					Документы[докст.ТипОбъекта].Перерасчет(д1.Ссылка,Ложь);
				КонецЕсли;
				
				Если Не Версионирование Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("документ "+д1+" пересчитан");
				КонецЕсли;
				
				д1.Записать(РежимЗаписиДокумента.Запись);
				Если докст.НомерСортировки = 3 Тогда
					// СМ_СметныйСоставВызовСервера.ПеренумероватьДерево(д1.Ссылка);
				КонецЕсли;

			КонецЕсли;
			Если докст.НомерСортировки <= 3 Тогда
				СтрТЗ = ТЗЗагрузки.Добавить();
				СтрТЗ.Ссылка = докст.Ссылка;
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ОтменитьТранзакцию();
	КонецЕсли;
	
	Если Откат Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнятьРеквизиты(новэлемент,Чтение)
	
	Пока Чтение.Прочитать() Цикл 
		Если Чтение.Имя = "ТабличнаяЧасть" Тогда
			Чтение.ПрочитатьАтрибут();
			ИмяТЧ = Чтение.Значение;
			Попытка
				ЭтоГруппа = новэлемент.ЭтоГруппа;
			Исключение
				ЭтоГруппа = Ложь;
			КонецПопытки;
			Если Не ЭтоГруппа Тогда
				Попытка
					ЗполнениеТабличнойЧасти(новэлемент[ИмяТЧ],Чтение);
				Исключение
					Продолжить;
				КонецПопытки;
			КонецЕсли;
		ИначеЕсли Чтение.ТипУзла <> ТипУзлаXML.КонецЭлемента Тогда 
			Создатьреквизит(новэлемент,Чтение);
		ИначеЕсли Чтение.Имя = "ТабличныеЧасти"  Тогда 

		ИначеЕсли Чтение.Имя = "Объект"  Тогда 
			Возврат; 
 		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

Процедура Создатьреквизит(новэлемент,Чтение)
	
	
	Пока Чтение.ПрочитатьАтрибут() Цикл 
		
		Если Чтение.Имя = "Значение" Тогда
			Значение = Чтение.Значение;
		ИначеЕсли Чтение.Имя = "Ссылка" Тогда 
			
			Если СокрЛП(Чтение.Значение) = "пусто" Тогда
				ЗначениеСсылки = 0;			
			Иначе                                                       
				ЗначениеСсылки = Число(Чтение.Значение);
			КонецЕсли;
			
			Попытка
				Значение = ТаблицаСсылок.Найти(Число(Чтение.Значение),"НомерПоПорядку").Ссылка;
			Исключение
				Событие = НСтр("ru = 'Исключение Смета 3.0'");
				СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);
			КонецПопытки;
		ИначеЕсли Чтение.Имя = "Имя" Тогда 
			ИмяРекв = Чтение.Значение; 
		ИначеЕсли Чтение.Имя = "Тип" Тогда 
			Если Найти(Чтение.Значение,"Перечисление.") > 0 Тогда
				ИмяПеречисления = СтрЗаменить(Чтение.Значение,"Перечисление.","");	 
				Попытка
					Значение = ПолучитьЗначениеПеречисления(ИмяПеречисления,Значение);
				Исключение
					Значение = Неопределено;
				КонецПопытки;
			КонецЕсли;
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда 
		КонецЕсли;
	КонецЦикла;
	
	Если ((ИмяРекв = "Код") И (ИмяОбъекта = "СМ_Ресурсы" ИЛИ ИмяОбъекта = "СМ_СметноНормативныеБазы" ИЛИ ИмяОбъекта = "СМ_ТерриториальныеРайоны"))
		ИЛИ (Не(ИмяРекв = "Код")) Тогда
		
		Если ИмяРекв = "НомерВДереве"
			ИЛИ ИмяРекв = "НомерВПределахСметы"
			ИЛИ ИмяРекв = "ПорНомер" Тогда
			новэлемент.ДополнительныеСвойства.Вставить(ИмяРекв,Число(Значение));
			Возврат;
		КонецЕсли;

		
		Попытка
			Если (ИмяРекв = "ИДРодителя") ИЛИ (ИмяРекв = "ИДСметы") ИЛИ (ИмяРекв = "ИДПозицииВладельца") Тогда
				стр 					= ТаблицаЗагрузкиИд.Добавить();
				стр.НомерПоПорядку 	= Число(Номерссылки);
				стр.ИмяРеквизита 		= ИмяРекв; 		
				стр.ИДРодителя 		= Число(ЗначениеСсылки);
			КонецЕсли;
			
			Если Значение = "Да" ИЛИ Значение = "Нет" Тогда
				Если ИмяРекв = "ЭтоГруппа" И Значение = "Да" Тогда
					ИмяСпр = новэлемент.метаданные().Имя;
					новэлемент = Справочники[ИмяСпр].СоздатьГруппу(); 
				Иначе
					новэлемент[ИмяРекв] = ?(Значение = "Да",Истина,Ложь);
				КонецЕсли;
			Иначе
				новэлемент[ИмяРекв] = Значение;
			КонецЕсли;
		Исключение
			Событие = НСтр("ru = 'Исключение Смета 3.0'");
			СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);
		КонецПопытки;
	КонецЕсли;
	
	Возврат;

КонецПроцедуры

Функция ПолучитьЗначениеПеречисления(ИмяПеречисления,ЗначениеПеречисления)
	
	Для Каждого ЭлементПеречисления Из Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления Цикл
		Если ЭлементПеречисления.Синоним = Строка(ЗначениеПеречисления) Тогда
			Возврат Перечисления[ИмяПеречисления][ЭлементПеречисления.Имя];
		КонецЕсли; 
	КонецЦикла;
	
КонецФункции

Процедура ЗполнениеТабличнойЧасти(новэлемент,Чтение)
	Пока Чтение.Прочитать() Цикл 
		Если Чтение.Имя = "СтрокаТабличнойЧасти" Тогда
			новаястр = новэлемент.Добавить();
			Чтение.Прочитать();
			Пока(Чтение.Имя <> "СтрокаТабличнойЧасти") Цикл
				Создатьреквизит(новаястр,Чтение); 
				Чтение.Прочитать();
			КонецЦикла;
		ИначеЕсли (Чтение.Имя = "ТабличнаяЧасть") Тогда 
			Возврат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ЗагрузитьОбразыДокументов(ПутьКФайлу,Записывать) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаСсылок = Новый ТаблицаЗначений;
	ТаблицаСсылок.Очистить();
	ТаблицаСсылок.Колонки.Добавить("Ссылка");	
	ТаблицаСсылок.Колонки.Добавить("НомерПоПорядку");            	
	ТаблицаСсылок.Колонки.Добавить("Тип");            
	ТаблицаСсылок.Колонки.Добавить("ТипОбъекта");       
	ТаблицаСсылок.Колонки.Добавить("НомерСортировки");                
	ТаблицаСсылок.Колонки.Добавить("ИДРодителя"); 
	ТаблицаСсылок.Колонки.Добавить("ИДПозицииВладельца");
	ТаблицаСсылок.Колонки.Добавить("НомерВДереве");            
	ТаблицаСсылок.Колонки.Добавить("НомерВПределахСметы");       
	ТаблицаСсылок.Колонки.Добавить("ПорНомер");                

	
	ТаблДок = Новый ТаблицаЗначений;
	ТаблДок.Колонки.Добавить("Ссылка");
	
	ТаблицаЗагрузкиИд =  Новый ТаблицаЗначений;
	ТаблицаЗагрузкиИд.Очистить();
	ТаблицаЗагрузкиИд.Колонки.Добавить("НомерПоПорядку");
	ТаблицаЗагрузкиИд.Колонки.Добавить("ИмяРеквизита");	
	ТаблицаЗагрузкиИд.Колонки.Добавить("ИДРодителя");
	
	ИмяВременногоФайла = ПутьКФайлу;
	
	ТекстОшибки = "";
	
	Чтение = Новый ЧтениеXML; 
	Чтение.ОткрытьФайл(ИмяВременногоФайла); 
	Пока Чтение.Прочитать() Цикл 

		//  Прочитать "структурные части" элементов. 
		//  Проверить, какая часть элемента - текущая. 
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			ИмяУзла = Чтение.Имя; 
			
			Если ИмяУзла = "Объект" Тогда
				СтруктураОбъекта 	= Новый Структура;
				СтруктураАтрибутов 	= Новый Структура; 
				СтруктураТЧ			= Новый Структура;
				ТекИмяТЧ			= "";
				Номерссылки = 0;
				Пока (Чтение.ТипУзла <> ТипУзлаXML.КонецЭлемента) И Чтение.ПрочитатьАтрибут() Цикл 
					//  Прочитать данные узла атрибута. 
					ТипУзла 	= Чтение.ТипУзла; 
					Имя 		= Чтение.Имя; 
					Значение 	= Чтение.Значение; 
					//  Обработать полученные значения.
					Если Имя = "Тип" Тогда
						СтруктураОбъекта.Вставить(Имя,Значение);
						Если Найти(Чтение.Значение,"Справочник") > 0 Тогда 	
							
							ИмяОбъекта = СтрЗаменить(Чтение.Значение,"Справочник.","");	
							
							СсылкаНового = Справочники[ИмяОбъекта].ПолучитьСсылку();
							новэлемент = Справочники[ИмяОбъекта].СоздатьЭлемент();
							новэлемент.УстановитьСсылкуНового(СсылкаНового);
							
							НоваяЗапись = ТаблицаСсылок.Добавить();
							НоваяЗапись.НомерПоПорядку = Число(Номерссылки);
							НоваяЗапись.Тип = "Справочник";
							Пока Чтение.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл 
								ЗаполнятьРеквизиты(новэлемент,Чтение);
							КонецЦикла;
							
							// СНБ ищем сначала по коду, потом по наименованию
							Если ИмяОбъекта = "СМ_СметноНормативныеБазы" Тогда
								резпоиска = Справочники.СМ_Ресурсы.НайтиПоКоду(новэлемент.Код);
								Если резпоиска = Справочники[ИмяОбъекта].ПустаяССылка() Тогда 
									резпоиска = Справочники[ИмяОбъекта].НайтиПоНаименованию(новэлемент.Наименование);
								КонецЕсли;
							// Ресурсы подгружаем по коду
							ИначеЕсли ИмяОбъекта = "СМ_Ресурсы" Тогда
								резпоиска = Справочники.СМ_Ресурсы.НайтиПоКоду(новэлемент.Код);
							Иначе
								резпоиска = Справочники[ИмяОбъекта].НайтиПоНаименованию(новэлемент.Наименование);
							КонецЕсли;
							
							Если резпоиска <> Справочники[ИмяОбъекта].ПустаяССылка() Тогда 
								НоваяЗапись.Ссылка = резпоиска.Ссылка;
							Иначе
								Если Записывать Тогда
									новэлемент.ОбменДанными.Загрузка = Истина;
									новэлемент.Записать();
									новэлемент = новэлемент.Ссылка;
								КонецЕсли;
								НоваяЗапись.Ссылка = новэлемент;
							КонецЕсли;
						Иначе 
							ИмяОбъекта = СтрЗаменить(Чтение.Значение,"Документ.","");

							НоваяЗапись = ТаблицаСсылок.Добавить();
							НоваяЗапись.Тип = "Документ";
							НоваяЗапись.НомерПоПорядку = Число(Номерссылки); 
							НоваяЗапись.ТипОбъекта = ИмяОбъекта;
							
							Если ИмяОбъекта = "СМ_ОбъектнаяСмета" Тогда
								НоваяЗапись.НомерСортировки = 1;
							ИначеЕсли ИмяОбъекта = "СМ_СводнаяСмета" Тогда
								НоваяЗапись.НомерСортировки = 2;
							ИначеЕсли ИмяОбъекта = "СМ_ЛокальнаяСмета" Тогда 
								НоваяЗапись.НомерСортировки = 3;
							ИначеЕсли ИмяОбъекта = "СМ_ПозицияЛокальнойСметы" Тогда 
								НоваяЗапись.НомерСортировки = 7;
							ИначеЕсли ИмяОбъекта = "СМ_РазделЛокальнойСметы" Тогда 
								НоваяЗапись.НомерСортировки = 8;
							Иначе 
								НоваяЗапись.НомерСортировки = 6;
							КонецЕсли;
							
							СсылкаНового = Документы[ИмяОбъекта].ПолучитьСсылку();
							новэлемент = Документы[ИмяОбъекта].СоздатьДокумент();
							новэлемент.УстановитьСсылкуНового(СсылкаНового);
							
							Пока  Чтение.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл 
								ЗаполнятьРеквизиты(новэлемент,Чтение);
							КонецЦикла;
							
							Если Записывать Тогда
															
								Если новэлемент.ДополнительныеСвойства.Свойство("НомерВДереве") Тогда
									НоваяЗапись.НомерВДереве = новэлемент.ДополнительныеСвойства.НомерВДереве;
									НоваяЗапись.НомерВПределахСметы = новэлемент.ДополнительныеСвойства.НомерВПределахСметы;
									НоваяЗапись.ПорНомер = новэлемент.ДополнительныеСвойства.ПорНомер;
									новэлемент.ДополнительныеСвойства.Очистить();
									новэлемент.ДополнительныеСвойства.Вставить("Смета3");
								КонецЕсли;

								новэлемент.УстановитьНовыйНомер(); 
								
								Если Не ЗначениеЗаполнено(новэлемент.Дата) Тогда
									новэлемент.Дата = ТекущаяДатаСеанса();
								КонецЕсли;
								
								новэлемент.Записать();
								новэлемент = новэлемент.Ссылка;
							КонецЕсли;

							НоваяЗапись.Ссылка = новэлемент;		
						КонецЕсли;

					ИначеЕсли Имя = "НПП" Тогда 
					    Номерссылки = Чтение.Значение;
					ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда  
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	

	// Пересчет документов
	отбор = Новый Структура;
	отбор.Вставить("Тип","Документ");
	ТаблицаСсылок.Сортировать(НСтр("ru='НомерСортировки убыв, НомерПоПорядку убыв'")); 
	Для Каждого докст Из ТаблицаСсылок.НайтиСтроки(отбор) Цикл 
		
		д1 = докст.Ссылка.ПолучитьОбъект();
		отбор1 = Новый Структура;
		отбор1.Вставить("НомерПоПорядку",докст.НомерПоПорядку);
		// отбор1.Вставить("ИмяРеквизита","ИДРодителя");
		
		Для Каждого док Из ТаблицаЗагрузкиИд.НайтиСтроки(отбор1) Цикл 
			искомыйродитель = ТаблицаСсылок.Найти(док.ИДРодителя,"НомерПоПорядку");
			Если искомыйродитель <> Неопределено Тогда
				д1[док.ИмяРеквизита] = искомыйродитель.Ссылка;
			КонецЕсли;
		КонецЦикла;
		
		
		Если докст.НомерСортировки <= 3 И Записывать Тогда
			Если докст.ТипОбъекта = "СМ_ЛокальнаяСмета" Тогда
				Документы[докст.ТипОбъекта].Перерасчет(д1.Ссылка,Ложь,,Ложь);
			Иначе
				Документы[докст.ТипОбъекта].Перерасчет(д1.Ссылка,Ложь);
			КонецЕсли;
		ИначеЕсли Записывать Тогда
			
			д1.ОбменДанными.Загрузка = Истина;
			д1.Записать();
			
			Если ТипЗнч(докст.Ссылка) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
				СМ_СметаВызовСервера.УстановитьНомерДокумента(докст.Ссылка,докст.ПорНомер,докст.НомерВПределахСметы,докст.НомерВДереве, , "СМ_ПозицияЛокальнойСметы");
			ИначеЕсли ТипЗнч(докст.Ссылка) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
				СМ_СметаВызовСервера.УстановитьНомерДокумента(докст.Ссылка,докст.ПорНомер,докст.НомерВПределахСметы,докст.НомерВДереве, , "СМ_РазделЛокальнойСметы");
			КонецЕсли;
			
		КонецЕсли;
		
		Если докст.НомерСортировки = 3 И Записывать Тогда
			СМ_СметныйСоставВызовСервера.ПеренумероватьДерево(докст.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Инд = ТаблицаСсылок.Количество()-1;
	
	Пока Инд>=0 Цикл
		Стр = ТаблицаСсылок.Получить(Инд);
		Если Не Стр.Тип = "Документ" Тогда
			ТаблицаСсылок.Удалить(стр);
		КонецЕсли;
		Инд = Инд - 1;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ТаблицаСсылок;
КонецФункции

#КонецОбласти

#Область НаУдаление

//Процедура Удалить_ЗагрузитьДокументыВеб(Адрес,ТЗЗагрузки)
//	
//	ТаблицаСсылок = Новый ТаблицаЗначений;
//	ТаблицаСсылок.Очистить();
//	ТаблицаСсылок.Колонки.Добавить("Ссылка");	
//	ТаблицаСсылок.Колонки.Добавить("НомерПоПорядку");            	
//	ТаблицаСсылок.Колонки.Добавить("Тип");            
//	ТаблицаСсылок.Колонки.Добавить("ТипОбъекта");       
//	ТаблицаСсылок.Колонки.Добавить("НомерСортировки");                
//	ТаблицаСсылок.Колонки.Добавить("НомерВДереве");            
//	ТаблицаСсылок.Колонки.Добавить("НомерВПределахСметы");       
//	ТаблицаСсылок.Колонки.Добавить("ПорНомер");                
//	
//	ТаблДок = Новый ТаблицаЗначений;
//	ТаблДок.Колонки.Добавить("Ссылка");
//	
//	ТаблицаЗагрузкиИд =  Новый ТаблицаЗначений;
//	ТаблицаЗагрузкиИд.Очистить();
//	ТаблицаЗагрузкиИд.Колонки.Добавить("НомерПоПорядку");
//	ТаблицаЗагрузкиИд.Колонки.Добавить("ИмяРеквизита");	
//	ТаблицаЗагрузкиИд.Колонки.Добавить("ИДРодителя");
//	
//	ИмяФайла = ПолучитьИмяВременногоФайла();
//	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
//	ДвоичныеДанные.Записать(ИмяФайла);
//	ПутьКФайлу = ИмяФайла;
//	
//	Чтение = Новый ЧтениеXML; 
//	Чтение.ОткрытьФайл(ПутьКФайлу); 
//	Пока Чтение.Прочитать() Цикл 
//		
//		// Прочитать "структурные части" элементов. 
//		// Проверить, какая часть элемента - текущая. 
//		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
//			ИмяУзла = Чтение.Имя; 
//			
//			Если ИмяУзла = "Объект" Тогда
//				СтруктураОбъекта 	= Новый Структура;
//				СтруктураАтрибутов 	= Новый Структура; 
//				СтруктураТЧ			= Новый Структура;
//				ТекИмяТЧ			= "";
//				Номерссылки = 0;
//				Пока (Чтение.ТипУзла <> ТипУзлаXML.КонецЭлемента) И Чтение.ПрочитатьАтрибут() Цикл 
//					//  Прочитать данные узла атрибута. 
//					ТипУзла 	= Чтение.ТипУзла; 
//					Имя 		= Чтение.Имя; 
//					Значение 	= Чтение.Значение; 
//					//  Обработать полученные значения.
//					Если Имя = "Тип" Тогда
//						СтруктураОбъекта.Вставить(Имя,Значение);
//						Если Найти(Чтение.Значение,"Справочник") > 0 Тогда 	
//							
//							ИмяОбъекта = СтрЗаменить(Чтение.Значение,"Справочник.","");						    				
//							новэлемент = Справочники[ИмяОбъекта].СоздатьЭлемент();
//							
//							НоваяЗапись = ТаблицаСсылок.Добавить();
//							НоваяЗапись.НомерПоПорядку = Число(Номерссылки);
//							НоваяЗапись.Тип = "Справочник";
//							Пока  Чтение.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл 
//								ЗаполнятьРеквизиты(новэлемент,Чтение);
//							КонецЦикла;
//							
//							Если Не (ИмяОбъекта = "СМ_Ресурсы")Тогда    //Ресурсы подгружаем по коду
//								резпоиска = Справочники[ИмяОбъекта].НайтиПоНаименованию(новэлемент.Наименование);
//							Иначе 
//								резпоиска = Справочники.СМ_Ресурсы.НайтиПоКоду(новэлемент.Код);
//							КонецЕсли;
//							
//							Если резпоиска <> Справочники[ИмяОбъекта].ПустаяССылка() Тогда 
//								НоваяЗапись.Ссылка = резпоиска.Ссылка;
//							Иначе 
//								новэлемент.Записать();
//								НоваяЗапись.Ссылка = новэлемент.Ссылка;
//							КонецЕсли;
//							
//						Иначе 
//							
//							НоваяЗапись = ТаблицаСсылок.Добавить();
//							НоваяЗапись.Тип = "Документ";
//							НоваяЗапись.НомерПоПорядку = Число(Номерссылки); 
//							ИмяОбъекта = СтрЗаменить(Чтение.Значение,"Документ.","");						    				
//							НоваяЗапись.ТипОбъекта = ИмяОбъекта;
//							
//							Если ИмяОбъекта = "СМ_ОбъектнаяСмета" Тогда
//								НоваяЗапись.НомерСортировки = 1;
//							ИначеЕсли ИмяОбъекта = "СМ_СводнаяСмета" Тогда
//								НоваяЗапись.НомерСортировки = 2;
//							ИначеЕсли ИмяОбъекта = "СМ_ЛокальнаяСмета" Тогда 
//								НоваяЗапись.НомерСортировки = 3;
//							Иначе 
//								НоваяЗапись.НомерСортировки = 6;
//							КонецЕсли;
//							
//							// новэлемент = Документы[ИмяОбъекта].СоздатьДокумент();
//							СсылкаНового = Документы[ИмяОбъекта].ПолучитьСсылку();
//							новэлемент = Документы[ИмяОбъекта].СоздатьДокумент();
//							новэлемент.УстановитьСсылкуНового(СсылкаНового);

//							Пока  Чтение.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл 
//								ЗаполнятьРеквизиты(новэлемент,Чтение);
//							КонецЦикла;
//							
//							Если новэлемент.ДополнительныеСвойства.Свойство("НомерВДереве") Тогда
//								НоваяЗапись.НомерВДереве = новэлемент.ДополнительныеСвойства.НомерВДереве;
//								НоваяЗапись.НомерВПределахСметы = новэлемент.ДополнительныеСвойства.НомерВПределахСметы;
//								НоваяЗапись.ПорНомер = новэлемент.ДополнительныеСвойства.ПорНомер;
//								новэлемент.ДополнительныеСвойства.Очистить();
//								новэлемент.ДополнительныеСвойства.Вставить("Смета3");
//							КонецЕсли;
//							
//							новэлемент.УстановитьНовыйНомер();
//							
//							Если Не ЗначениеЗаполнено(новэлемент.Дата) Тогда
//								новэлемент.Дата = ТекущаяДатаСеанса();
//							КонецЕсли;
//							
//							новэлемент.Записать(); 				
//							НоваяЗапись.Ссылка = новэлемент.Ссылка;		
//						КонецЕсли;
//						
//					ИначеЕсли Имя = "НПП" Тогда 
//						Номерссылки = Чтение.Значение;
//					ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда  
//					КонецЕсли;
//				КонецЦикла;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;	
//	
//	// Пересчет документов
//	отбор = Новый Структура;
//	отбор.Вставить("Тип","Документ");
//	ТаблицаСсылок.Сортировать(НСтр("ru='НомерСортировки убыв, НомерПоПорядку убыв'")); 
//	Для Каждого докст Из ТаблицаСсылок.НайтиСтроки(отбор) Цикл 
//		отбор1 = Новый Структура;
//		отбор1.Вставить("НомерПоПорядку",докст.НомерПоПорядку);
//		д1 = докст.Ссылка.ПолучитьОбъект();
//		Для Каждого док Из ТаблицаЗагрузкиИд.НайтиСтроки(отбор1) Цикл 
//			искомыйродитель = ТаблицаСсылок.Найти(док.ИДРодителя,"НомерПоПорядку");
//			Если искомыйродитель <> Неопределено Тогда
//				д1[док.ИмяРеквизита] = искомыйродитель.Ссылка;
//			КонецЕсли;
//		КонецЦикла;
//		
//		д1.ПроверитьЗаполнение();
//		д1.ОбменДанными.Загрузка = Истина;
//		д1.Записать();
//		
//		Если ТипЗнч(докст.Ссылка) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
//			СМ_СметаВызовСервера.УстановитьНомерДокумента(докст.Ссылка,докст.ПорНомер,докст.НомерВПределахСметы,докст.НомерВДереве, , "СМ_ПозицияЛокальнойСметы");
//		ИначеЕсли ТипЗнч(докст.Ссылка) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
//			СМ_СметаВызовСервера.УстановитьНомерДокумента(докст.Ссылка,докст.ПорНомер,докст.НомерВПределахСметы,докст.НомерВДереве, , "СМ_РазделЛокальнойСметы");
//		КонецЕсли;
//	КонецЦикла;
//	
//	Для Каждого докст Из ТаблицаСсылок.НайтиСтроки(отбор) Цикл 
//		Если докст.НомерСортировки <= 3 Тогда
//			д1 = докст.Ссылка.ПолучитьОбъект();
//			Документы[докст.ТипОбъекта].Перерасчет(д1.Ссылка,Ложь);
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("документ "+д1+" пересчитан");
//			д1.Записать(РежимЗаписиДокумента.Запись);
//			Если докст.НомерСортировки = 3 Тогда
//				// СМ_СметныйСоставВызовСервера.ПеренумероватьДерево(д1.Ссылка);
//			КонецЕсли;
//		КонецЕсли;
//		Если докст.НомерСортировки <= 3 Тогда
//			СтрТЗ = ТЗЗагрузки.Добавить();
//			СтрТЗ.Ссылка = докст.Ссылка;
//		КонецЕсли;
//	КонецЦикла;
//	
//КонецПроцедуры

#КонецОбласти
